{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convconvPRE_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convconvPRE_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convconvPRE", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bnconvPRE_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bnconvPRE_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bnconvPRE_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bnconvPRE_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bnconvPRE", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "actconvPRE", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_a0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_a0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 1], [13, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_a0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_a0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_a0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_a0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_b0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_b0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_b0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_b0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_b0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_b0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "adj1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "adj1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "adj1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[27, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_a1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_a1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_a1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_a1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_a1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_a1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_b1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_b1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_b1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_b1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_b1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_b1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[49, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_a2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_a2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_a2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_a2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_a2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_a2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_a2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_b2_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b2_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_b2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1_b2", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1_b2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_b2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_b2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_b2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[68, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1214_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1214_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1214", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1214_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1214_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1214_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1214_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1214", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act1214", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_a0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_a0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0], [81, 0, 1], [82, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act2_a0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_a0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_a0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_a0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_b0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_b0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act2_b0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_b0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_b0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_b0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "adj2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "adj2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "adj2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[84, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[96, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_a1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_a1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_a1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 1], [104, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act2_a1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_a1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_a1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_a1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_b1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2_b1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act2_b1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_b1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_b1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_b1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[118, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9854_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9854_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv9854", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn9854_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn9854_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn9854_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn9854_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn9854", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act9854", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_a0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_a0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act3_a0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_a0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_a0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_a0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_b0_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b0_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_b0", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act3_b0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_b0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_b0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_b0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "adj3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "adj3_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "adj3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[134, 0, 0], [147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[146, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_a1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_a1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_a1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act3_a1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_a1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_a1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_a1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_b1_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b1_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_b1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn3_b1", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 1], [163, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act3_b1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_b1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_b1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_b1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[168, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn4", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0], [175, 0, 1], [176, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[169, 0, 0], [182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn5_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn5", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 1], [188, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[169, 0, 0], [194, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn6_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn6_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn6_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn6_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn6", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0], [199, 0, 1], [200, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[202, 0, 0], [203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "10", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[169, 0, 0], [206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn7_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn7_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn7_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn7_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn7", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[208, 0, 0], [209, 0, 0], [210, 0, 0], [211, 0, 1], [212, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "act7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[214, 0, 0], [215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[181, 0, 0], [193, 0, 0], [205, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"target_shape": "(0,)"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "Softmax", 
      "inputs": [[218, 0, 0], [221, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    16, 
    17, 
    19, 
    20, 
    21, 
    22, 
    25, 
    26, 
    28, 
    29, 
    32, 
    33, 
    34, 
    35, 
    38, 
    39, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    66, 
    67, 
    70, 
    71, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    94, 
    95, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    107, 
    108, 
    110, 
    111, 
    112, 
    113, 
    116, 
    117, 
    120, 
    121, 
    123, 
    124, 
    125, 
    126, 
    129, 
    130, 
    131, 
    132, 
    135, 
    136, 
    138, 
    139, 
    140, 
    141, 
    144, 
    145, 
    147, 
    148, 
    151, 
    152, 
    153, 
    154, 
    157, 
    158, 
    160, 
    161, 
    162, 
    163, 
    166, 
    167, 
    170, 
    171, 
    173, 
    174, 
    175, 
    176, 
    179, 
    180, 
    182, 
    183, 
    185, 
    186, 
    187, 
    188, 
    191, 
    192, 
    194, 
    195, 
    197, 
    198, 
    199, 
    200, 
    203, 
    204, 
    206, 
    207, 
    209, 
    210, 
    211, 
    212, 
    215, 
    216, 
    219
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    199, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    214, 
    215, 
    216, 
    217, 
    218, 
    219, 
    220, 
    221, 
    222, 
    223, 
    224, 
    225, 
    228, 
    229, 
    230, 
    231, 
    232, 
    233, 
    234, 
    235, 
    236, 
    237, 
    238, 
    239, 
    242, 
    243, 
    244, 
    245, 
    246, 
    247, 
    248, 
    249, 
    250, 
    251, 
    252, 
    253, 
    256, 
    257, 
    258, 
    259, 
    260, 
    261, 
    262, 
    263, 
    264, 
    265
  ], 
  "heads": [[222, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}